@extends('layouts.admin.main')

@section('content')

<div id="main_body">    

    {{Form::open(['url'=>"admin/item/add"])}}
    <table class="tb">
        <tr>
            <th colspan="2"><h3>添加项目</h3></th>
        </tr>
        <tr>
            <td class="td_w120">项目名称</td>
          <td>
         
          {{Form::text('name')}}
          {{Form::select('type', ['个人项目'=>'个人项目', '团体项目'=>'团体项目'])}}
          {{Form::select('max',[0=>'不限制报名人数',1=>'每队最多报1人',2=>'每队最多报2人',3=>'每队最多报3人',4=>'每队最多报4人',5=>'每队最多报5人',6=>'每队最多报6人',7=>'每队最多报7人',8=>'每队最多报8人',9=>'每队最多报9人',10=>'每队最多报10人',11=>'每队最多报11人',12=>'每队最多报12人',13=>'每队最多报13人',14=>'每队最多报14人',15=>'每队最多报15人',16=>'每队最多报16人',17=>'每队最多报17人',18=>'每队最多报18人',19=>'每队最多报19人',20=>'每队最多报20人',21=>'每队最多报21人',22=>'每队最多报22人',23=>'每队最多报23人',24=>'每队最多报24人',25=>'每队最多报25人',26=>'每队最多报26人',27=>'每队最多报27人',28=>'每队最多报28人',29=>'每队最多报29人',30=>'每队最多报30人',31=>'每队最多报31人',32=>'每队最多报32人',33=>'每队最多报33人',34=>'每队最多报34人',35=>'每队最多报35人',36=>'每队最多报36人',37=>'每队最多报37人',38=>'每队最多报38人',39=>'每队最多报39人',40=>'每队最多报40人',41=>'每队最多报41人',42=>'每队最多报42人',43=>'每队最多报43人',44=>'每队最多报44人',45=>'每队最多报45人',46=>'每队最多报46人',47=>'每队最多报47人',48=>'每队最多报48人',49=>'每队最多报49人',50=>'每队最多报50人',51=>'每队最多报51人',52=>'每队最多报52人',53=>'每队最多报53人',54=>'每队最多报54人',55=>'每队最多报55人',56=>'每队最多报56人',57=>'每队最多报57人',58=>'每队最多报58人',59=>'每队最多报59人',60=>'每队最多报60人',61=>'每队最多报61人',62=>'每队最多报62人',63=>'每队最多报63人',64=>'每队最多报64人',65=>'每队最多报65人',66=>'每队最多报66人',67=>'每队最多报67人',68=>'每队最多报68人',69=>'每队最多报69人',70=>'每队最多报70人',71=>'每队最多报71人',72=>'每队最多报72人',73=>'每队最多报73人',74=>'每队最多报74人',75=>'每队最多报75人',76=>'每队最多报76人',77=>'每队最多报77人',78=>'每队最多报78人',79=>'每队最多报79人',80=>'每队最多报80人',81=>'每队最多报81人',82=>'每队最多报82人',83=>'每队最多报83人',84=>'每队最多报84人',85=>'每队最多报85人',86=>'每队最多报86人',87=>'每队最多报87人',88=>'每队最多报88人',89=>'每队最多报89人',90=>'每队最多报90人',91=>'每队最多报91人',92=>'每队最多报92人',93=>'每队最多报93人',94=>'每队最多报94人',95=>'每队最多报95人',96=>'每队最多报96人',97=>'每队最多报97人',98=>'每队最多报98人',99=>'每队最多报99人',100=>'每队最多报100人'])}}
          {{Form::submit('添加')}}
          <div style='color:red'>{{$errors->first('name')}}</div>
          </td>
        </tr>
        <tr>
            <td class="td_w120"></td>
            <td>
            
            </td>
        </tr>
    </table>
  {{Form::close()}}


  <table width="500" border="0" cellpadding="10" cellspacing="0" class="tb">
    <tr>
      <th colspan="3"><h3>已设项目</h3></th>
    </tr>
    <tr>
      <td class="td_w120"><strong>序号</strong></td>
      <td><strong>项目名称</strong></td>
      <td><strong>项目类别</strong></td>
      <td><strong>限制报名人数</strong></td>
      <td><strong>改/删</strong></td>
    </tr>
<!-- {{$i=0}} -->
@foreach ($items as $d)
<!-- {{$i++}} -->
    <tr>
      <td>{{$i}}</td>
      <td>{{$d->name}}</td>
      <td>{{$d->type}}</td>
      <td>{{$d->max}}</td>
      <td>
      {{HTML::link("admin/item/edit/$d->id", '修改')}}
      {{HTML::link("admin/item/del/$d->id", '删除', ['onclick'=>"return confirm(\"确认删除 $d->name ？\")"] )}}
      </td>
    </tr>
@endforeach
  </table>
</div>

@stop